Revit 2026 API
ModelPathUtils Class
 Utility functions using ModelPaths
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ModelPathUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class ModelPathUtils
Public NotInheritable Class ModelPathUtils
public ref class ModelPathUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ModelPathUtils = class end
The ModelPathUtils type exposes the following members.
Properties
Name | Description
CloudRegionEMEA |  The name of cloud region EMEA.
CloudRegionUS |  The name of cloud region US.
Top
Methods
Name | Description
ConvertCloudGUIDsToCloudPath |  Converts a pair of cloud project and model GUIDs to a valid cloud path.
ConvertModelPathToUserVisiblePath |  Gets a string version of the path of a given ModelPath.
ConvertUserVisiblePathToModelPath |  Converts a user-visible path (string) to a ModelPath.
IsValidUserVisibleFullServerPath |  Determines whether the given string represents a valid server path.
Top
See Also
Reference
Autodesk.Revit.DB Namespace